prodotto-kar/src/main/resources/NoPlugin/Esempi/DCSanita_FSE_2009-01_consultaEventiDaFlussi.in.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<!--
<TestInfo>
	<Autore>Graziano Angelè</Autore>
	<DataPreparazione>6/04/2009</DataPreparazione>
	<CodiceTest>FSEIN.8060000006.01-01</CodiceTest>
	<CodiceContesto>C06</CodiceContesto>
	<TipoTest>F</TipoTest>
	<Priorita>H</Priorita>
	<DescrizioneCaso>Sono preventivamente inseriti nel DB:
	
	  - un referto specialistico non di rete in chiaro;
	  - un referto specialistico appartenente alla rete di patologia NFR in chiaro;
	  - un referto di ricovero appartenente alla rete di patologia NFR, oscurato per il solo oscuramento volontario del cittadino;
	  - un referto di pronto soccorso appartenente alla rete di patologia NFR, oscurato.
	
	Viene effettuata la ricerca da un operatore che ha solo l'accesso generalista (presenza della SC), e viene velorizzato in input l'idFolder
	relativo al folder contenente il referto specialistico non di rete.
	</DescrizioneCaso>
	<DescrizioneRisultatoAtteso>Viene estratto il solo referto specialistico non di rete con la corrispondente struttura del fascicolo</DescrizioneRisultatoAtteso>
</TestInfo>
-->
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" soap-env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<soap-env:Header>
		<t:CoopContext xmlns:t="http://www.crs.lombardia.it/schemas/mw/2004-01/coopcontext/">
			<Sla>
				<Log>
					<Global>
						<TrackID>121551124945253853</TrackID>
						<Timestamp>08-07-2008 12:00:49</Timestamp>
					</Global>
				</Log>
			</Sla>
			<Security>
				<CitCardPresent>true</CitCardPresent>
				<CitAuth>true</CitAuth>
				<CitCF>TSTCRM02T02T002T</CitCF>
				<CitSmartCardSN>171FW588</CitSmartCardSN>
				<FunContext>
					<credential>
						<vrs>
							<mjr>2</mjr>
							<min>1</min>
						</vrs>
						<validity>
							<emittedDate>08/07/2008 11:57:22</emittedDate>
							<sessionMaxTime>28800000</sessionMaxTime>
						</validity>
						<role>
							<code>6</code>
							<description>MMG/PLS</description>
						</role>
						<userId>RMPMRA63A20M952K</userId>
						<FirstName>MAURO</FirstName>
						<LastName>RAMPI</LastName>
						<ctf>
							<reg>
								<cod/>
								<des/>
							</reg>
							<app>
								<cod/>
								<des/>
							</app>
							<pro>
								<cod/>
								<des/>
							</pro>
							<ter>
								<cod/>
								<des/>
							</ter>
							<str>
								<cod>691489</cod>
								<des>ASL CREMONA</des>
							</str>
							<pre>
								<cod>03038000</cod>
								<des/>
							</pre>
						</ctf>
						<prv>
							<iupSeed>00000</iupSeed>
							<DF>F</DF>
							<Ref>RAMPI/MAURO/RMPMRA63A20M952K/17941</Ref>
						</prv>
					</credential>
				</FunContext>
			</Security>
			<Transport>
				<Mode>Sync</Mode>
				<Dest>DCSanita</Dest>
			</Transport>
		</t:CoopContext>
		<a:AppContext xmlns:a="http://www.crs.lombardia.it/schemas/mw/2004-01/appcontext/">
			<Request clientProd="DCSanita" clientVer="1.0"/>
		</a:AppContext>
	</soap-env:Header>
	<soap-env:Body>
		<m:FSE.consultaEventiDaFlussi xmlns:m="http://www.crs.lombardia.it/schemas/DCSanita/FSE/2009-01/consultaEventiDaFlussi/" dataSetVersion="1.0">
			<richiestaConsultaEventiDaFlussi>
				<cittadino>
					<idCittadino tipo="CF">TSTCRM02T02T002T</idCittadino>
				</cittadino>
				<dataInizio>20060101</dataInizio>
				<dataFine>20061231</dataFine>
				<nMaxRecord>2</nMaxRecord>
				<nPagina>1</nPagina>
			</richiestaConsultaEventiDaFlussi>
		</m:FSE.consultaEventiDaFlussi>
	</soap-env:Body>
</soap-env:Envelope>
